In [73]:
import pandas as pd 
import numpy as np

In [9]:
data = {
    "ID":[1,2,3,4],
    "marks":[10,11,221,23]
}

df = pd.DataFrame(data,index=['d1','d2','d3','d4'])

print(df)

    ID  marks
d1   1     10
d2   2     11
d3   3    221
d4   4     23

In [22]:
data = {
    "ID":[1,2,3,4],
    "marks":[10,11,221,23]
}

df1 = pd.DataFrame(data,index=['d1','d2','d4','d5'])

print(df1)

    ID  marks
d1   1     10
d2   2     11
d4   3    221
d5   4     23

In [23]:
pd.concat([df1,df],axis=1)

     ID  marks   ID  marks
d1  1.0   10.0  1.0   10.0
d2  2.0   11.0  2.0   11.0
d4  3.0  221.0  4.0   23.0
d5  4.0   23.0  NaN    NaN
d3  NaN    NaN  3.0  221.0

In [24]:
df.merge(df1,how='inner')

   ID  marks
0   1     10
1   2     11
2   3    221
3   4     23

In [39]:
data = {
    "key":["apple","ball","apple","apple","ball","cat"],
    "value":[10,11,12,13,14,15]
}

df = pd.DataFrame(data)

df

     key  value
0  apple     10
1   ball     11
2  apple     12
3  apple     13
4   ball     14
5    cat     15

In [37]:
data1 = {
    "group_val":[0,1,2]
}

df1 = pd.DataFrame(data1,index=["apple","ball","apple"])

df1

       group_val
apple          0
ball           1
apple          2

In [41]:
pd.merge(df,df1,right_index=True,left_on='key',how='outer')

     key  value  group_val
0  apple     10        0.0
0  apple     10        2.0
2  apple     12        0.0
2  apple     12        2.0
3  apple     13        0.0
3  apple     13        2.0
1   ball     11        1.0
4   ball     14        1.0
5    cat     15        NaN

In [42]:
technologies = {
    'Courses':["Spark","PY1","PY2","PY3"],
    'Fee':[2000,2500,3000,3500],
    'Duration':['30Days','40','50','60']
}
index_labels = ['r1','r2','r3','r4']
df2 = pd.DataFrame(technologies,index=index_labels)

In [43]:
technologies2 = {
    'Courses':["Spark","PY4","PY2","PY5"],
    'Fee':[2000,2500,3000,3500]
}
index_labels2 = ['r1','r6','r3','r5']
df3 = pd.DataFrame(technologies2,index=index_labels2)

In [44]:
pd.merge(df2,df3)

  Courses   Fee Duration
0   Spark  2000   30Days
1     PY2  3000       50

In [45]:
pd.merge(df2,df3,on='Courses')

  Courses  Fee_x Duration  Fee_y
0   Spark   2000   30Days   2000
1     PY2   3000       50   3000

In [46]:
df2.merge(df3)

  Courses   Fee Duration
0   Spark  2000   30Days
1     PY2  3000       50

In [48]:
pd.concat([df2,df3],axis=1)

   Courses     Fee Duration Courses     Fee
r1   Spark  2000.0   30Days   Spark  2000.0
r2     PY1  2500.0       40     NaN     NaN
r3     PY2  3000.0       50     PY2  3000.0
r4     PY3  3500.0       60     NaN     NaN
r6     NaN     NaN      NaN     PY4  2500.0
r5     NaN     NaN      NaN     PY5  3500.0

In [50]:
df2.join(df3,lsuffix="call",rsuffix="called")

   Coursescall  Feecall Duration Coursescalled  Feecalled
r1       Spark     2000   30Days         Spark     2000.0
r2         PY1     2500       40           NaN        NaN
r3         PY2     3000       50           PY2     3000.0
r4         PY3     3500       60           NaN        NaN

In [51]:
technologies2 = {
    'Course':["Spark","PY4","PY2","PY5"],
    'Fee':[2000,2500,3000,3500]
}
index_labels2 = ['r1','r6','r3','r5']
df4 = pd.DataFrame(technologies2,index=index_labels2)
df4

   Course   Fee
r1  Spark  2000
r6    PY4  2500
r3    PY2  3000
r5    PY5  3500

In [54]:
pd.append(df2,df4)

AttributeError: module 'pandas' has no attribute 'append'

In [57]:
import pandas as pd

student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8','S9'],
        'name': ['Scarlette Fisher','Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201,204]})

print("Original DataFrames:")
print(student_data1)
print("-------------------------------------")
print(student_data2)
print("\nJoin the said two dataframes along rows:")
result_data = pd.concat([student_data1, student_data2],axis=1)
print(result_data)

Original DataFrames:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
-------------------------------------
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Scarlette Fisher    200
2         S6  Carla Williamson    198
3         S7       Dante Morse    219
4         S8    Kaiser William    201
5         S9   Madeeha Preston    204

Join the said two dataframes along rows:
  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton  200.0         S4  Scarlette Fisher    201
1         S2      Ryder Storey  210.0         S5  Scarlette Fisher    200
2         S3      Bryce Jensen  190.0         S6  Carla Williamson    198
3         S4         Ed Bernal  222.0         S7       Dante Morse    219
4         S5       Kwame Morin  199.0         S8    Kaiser William    201
5        NaN               NaN    NaN         S9   Madeeha Preston    204

In [58]:
df2.duplicated()

r1    False
r2    False
r3    False
r4    False
dtype: bool

In [62]:
df = pd.DataFrame({
    "coumn1":["SESS"]*5 + ["Session"]*4,
    "column2":[1,1,1,1,5,6,7,8,9]
})

df

    coumn1  column2
0     SESS        1
1     SESS        1
2     SESS        1
3     SESS        1
4     SESS        5
5  Session        6
6  Session        7
7  Session        8
8  Session        9

In [67]:
df[df.duplicated()]

  coumn1  column2
1   SESS        1
2   SESS        1
3   SESS        1

In [70]:
df[df.duplicated()==False]

    coumn1  column2
0     SESS        1
4     SESS        5
5  Session        6
6  Session        7
7  Session        8
8  Session        9

In [76]:
data = np.arange(1,16).reshape(5,3)

dfx = pd.DataFrame(data,index=['Apple','Banana','Carrot','Dragonfruit','Episoidal'],columns=['store1','store2','store3'])

dfx

             store1  store2  store3
Apple             1       2       3
Banana            4       5       6
Carrot            7       8       9
Dragonfruit      10      11      12
Episoidal        13      14      15

In [84]:
dfx.notnull().sum().sum()

15

In [85]:
import pandas as pd

# Sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [25, 42, 31, 19, 50]}
df = pd.DataFrame(data)

# Define bins for different age groups
bins = [0, 18, 30, 40, 60]  # Age groups: 0-18, 19-30, 31-40, 41-60

# Define labels for the bins
labels = ['0-18', '19-30', '31-40', '41-60']

# Discretize the 'Age' column into bins using cut() function
df['Age_Group'] = pd.cut(df['Age'], bins=bins, labels=labels)

print(df)

      Name  Age Age_Group
0    Alice   25     19-30
1      Bob   42     41-60
2  Charlie   31     31-40
3    David   19     19-30
4      Eva   50     41-60

In [90]:
import numpy as np
import pandas as pd
dat = np.arange(80).reshape(10,8)
df = pd.DataFrame(dat)
sampler = np.random.permutation(10)
sampler
df.take(sampler),sampler

(    0   1   2   3   4   5   6   7
 9  72  73  74  75  76  77  78  79
 4  32  33  34  35  36  37  38  39
 0   0   1   2   3   4   5   6   7
 7  56  57  58  59  60  61  62  63
 6  48  49  50  51  52  53  54  55
 2  16  17  18  19  20  21  22  23
 5  40  41  42  43  44  45  46  47
 8  64  65  66  67  68  69  70  71
 1   8   9  10  11  12  13  14  15
 3  24  25  26  27  28  29  30  31,
 array([9, 4, 0, 7, 6, 2, 5, 8, 1, 3]))

In [91]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3   4   5   6   7
8  64  65  66  67  68  69  70  71
3  24  25  26  27  28  29  30  31
9  72  73  74  75  76  77  78  79

In [92]:
import pandas as pd
# Creating a sample DataFrame
data = {'A': [1, 2, 3, 4, 5],
        'B': ['a', 'b', 'c', 'd', 'e']}
df = pd.DataFrame(data)

# Example 1: Sample 2 random rows
sampled_rows = df.sample(n=2)
print("Sampled 2 random rows:")
print(sampled_rows)

# Example 2: Sample 30% of the rows
sampled_frac = df.sample(frac=0.3)
print("\nSampled 30% of the rows:")
print(sampled_frac)

Sampled 2 random rows:
   A  B
0  1  a
1  2  b

Sampled 30% of the rows:
   A  B
1  2  b
3  4  d

In [96]:
# Example 3: Sample with replacement
sampled_with_replace = df.sample(n=5, replace=True)

print("\nSampled with replacement:")
print(sampled_with_replace)

Sampled with replacement:
   A  B
1  2  b
3  4  d
0  1  a
3  4  d
1  2  b

In [ ]:
arr = [12,15,18,20,22,24,26,28,30]
q3 = np.percentile(arr,75)
q1 = np.percentile(arr,25)

q3-q1